Revit 2027 API
ParameterTypeId.StairsSupporttypeStructuralDepthOnRun Property
 "Structural Depth On Run": Structural Depth
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsSupporttypeStructuralDepthOnRun { get; }
Public Shared ReadOnly Property StairsSupporttypeStructuralDepthOnRun As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsSupporttypeStructuralDepthOnRun {
	ForgeTypeId^ get ();
}
static member StairsSupporttypeStructuralDepthOnRun : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace